app/graphql/mutations/sensor_data_create.rb

      def resolve(args)
        sensor_data_input = args[:sensor_data_input]
        sensor_data = SensorData.create(
          temperature: sensor_data_input[:temperature],
          humidity: sensor_data_input[:humidity],
        )
---
INSERT INTO "sensor_data" ("temperature", "humidity") VALUES ($1, $2) RETURNING "id"  [["temperature", 40.0], ["humidity", 55.0]]