app/graphql/mutations/service_create.rb

      def resolve(args)
        service_input = args[:service_input]
        service = Service.create(
          name: service_input[:name],
          on_duration: service_input[:on_duration],
          off_duration: service_input[:off_duration],
        )
---
INSERT INTO "services" ("name", "on_duration", "off_duration", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "lights"], ["on_duration", 12], ["off_duration", 12], ["created_at", "2018-09-17 18:48:46.565297"], ["updated_at", "2018-09-17 18:48:46.565297"]]