app/graphql/mutations/user_create.rb

      def resolve(args)
        user_input = args[:user_input]

        user = User.create(
          full_name: user_input[:full_name],
          email: user_input[:email],
        )
---
INSERT INTO "users" ("full_name", "email") VALUES ($1, $2) RETURNING "id"  [["full_name", "bob"], ["email", "bobsemail"]]